package models

type Storable interface {
	Save() error
	Load() error
}

// Ответ: Library

// 1. Library агрегирует в себе и книги (Books), и читателей (Readers).
// Сохранение и загрузка "состояния библиотеки" логически означает cохранение
// всей библиотеки целиком, а не отдельной книги или читателя.

// 2. Book и Reader — это отдельные части данных.
// Ими можно управлять, но сохранять "книгу отдельно от библиотеки" смысла мало.

// 3. Library —  точка входа для операций Save/Load:
//    Save() — записать всё состояние в файл,
//    Load() — восстановить всё
